runs/20260603T032240-t8-full-waltest/pgbench-barman-w24.log
pgbench (18.1 (Debian 18.1-1.pgdg13+2))
progress: 60.0 s, 11166.3 tps, lat 22.787 ms stddev 28.383, 0 failed
progress: 120.0 s, 14685.3 tps, lat 17.443 ms stddev 24.603, 0 failed
progress: 180.0 s, 17925.2 tps, lat 14.277 ms stddev 19.002, 0 failed
progress: 240.0 s, 21263.0 tps, lat 12.044 ms stddev 17.999, 0 failed
progress: 300.0 s, 22654.5 tps, lat 11.300 ms stddev 18.422, 0 failed
progress: 360.0 s, 19594.0 tps, lat 13.057 ms stddev 21.953, 0 failed
progress: 420.0 s, 16734.2 tps, lat 15.300 ms stddev 23.751, 0 failed
progress: 480.0 s, 17336.9 tps, lat 14.767 ms stddev 21.984, 0 failed
progress: 540.0 s, 16926.4 tps, lat 15.127 ms stddev 20.986, 0 failed
progress: 600.0 s, 19116.2 tps, lat 13.394 ms stddev 18.294, 0 failed
progress: 660.0 s, 23104.2 tps, lat 11.080 ms stddev 17.303, 0 failed
progress: 720.0 s, 24294.9 tps, lat 10.537 ms stddev 16.127, 0 failed
progress: 780.0 s, 18121.8 tps, lat 14.118 ms stddev 22.228, 0 failed
progress: 840.0 s, 16598.3 tps, lat 15.424 ms stddev 22.532, 0 failed
progress: 900.0 s, 16850.8 tps, lat 15.191 ms stddev 20.710, 0 failed
progress: 960.0 s, 17817.5 tps, lat 14.373 ms stddev 20.936, 0 failed
transaction type: /var/run/pgbench-wal-stress.pgbench
scaling factor: 1040
query mode: simple
number of clients: 256
number of threads: 256
maximum number of tries: 1
duration: 960 s
number of transactions actually processed: 17651568
number of failed transactions: 0 (0.000%)
latency average = 13.920 ms
latency stddev = 20.847 ms
initial connection time = 323.186 ms
tps = 18370.867658 (without initial connection time)